{
	"job" : [ {
		"company_name" : "Amazon",
		"job_title" : "Software Development Engineer II",
		"job_id" : "1031462",
		"category" : "Software Development",
		"location" : "Hyderabad, India",
		"country" : "India",
		"state" : "",
		"city" : "Hyderabad",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "January 13, 2020",
		"description" : "Do you enjoy solving very complex problems with simplest solutions? Are you excited by a fast paced multi-tasked environment? Would you like to help us innovate on behalf of Digital and Device customers?<br><br>Work hard. Have fun. Make history.<br>Amazon is the earth's most customer centric company. Along with being a retail company, it has a special focus on innovative technology and high-profile devices. We have worked to produce best-selling tablets with breakthrough hardware technology, e-readers that have revolutionized reading, Fire TV, a tiny yet powerful way to watch the best movies and TV shows in the comfort of your living room and Echo, our latest cutting edge product.<br>The Device, Digital & Alexa Support (aka. D2AS) organization goal is to provide the best customer experience and support for Amazon devices and digital applications. D2AS Technology team owns critical applications and backend services. The team has the charter to innovate customer experience avenues that will push the boundaries of customer-device interaction of devices.<br><br>key responsibilities as a member of this team:<br>- Contribute to the sub-system architecture and development for product initiatives and feature development<br>- Work in an Agile/Scrum environment to deliver high quality software<br>- Work side by side with partners, colleagues and teams on challenging problems<br>- Understand what's important when releasing software to end users and have been through the process from start to finish<br><br>The Role:<br>As a Software Development Engineer II, you will have the opportunity to work on software services that are designed to adapt to the evolving businesses of Amazon while improving the quality and productivity of our operations teams. These gains are driven by the controls and feedback of our systems, business metrics and user community to enable continuous improvement to our software, system design, and development processes. Our software allows our users to also improve their quality, timeliness, efficiency and policy adherence of customer support interactions.<br>Work in our platform will provide the opportunity to contribute to the complete vertical stack of an SOA based system, which is horizontally connected to most systems in the larger Amazon ecosystem. Areas include business intelligence, web service implementation, database design, web based applications, UI design and usability optimization.<br><br>The technical skills required for this role include strong object-oriented design and programming in Java or C++. Some scripting, SQL and data modeling is helpful. An understanding and experience with web based technologies is essential. These may include HTML, HTTP, Javascript, JSON, AJAX, apache, tomcat. Experience working pragmatically under deadlines with operational software is highly desired. In addition the role will offer project management, leadership and system design opportunities.<br>We are looking for passionate, hard-working, and talented individual who has experience building innovative, mission critical, high volume applications.<br><br><b>BASIC QUALIFICATIONS</b><br><br>- Bachelor's Degree in Computer Science or related field<br>- Computer Science fundamentals in object-oriented design and coding<br>- Computer Science fundamentals in data structures<br>- Computer Science fundamentals in algorithm design, problem solving, and complexity analysis<br>- Proficiency in, at least, one modern programming language such as C, C++, C# and/or Java<br><br><b>PREFERRED QUALIFICATIONS</b><br><br>- 1+ years professional experience in software development<br>- Master's degree in Computer Science or related field<br>- Knowledge of Perl or other scripting languages<br>- Experience with distributed (multi-tiered) systems, algorithms, and relational databases - Ability to effectively articulate technical challenges and solutions<br>- Deal well with ambiguous/undefined problems; ability to think abstractly",
		"URL" : "https://www.amazon.jobs/en/jobs/1031462/software-development-engineer-ii"
	}, {
		"company_name" : "Wipro",
		"job_title" : "Cloud Security-Lead",
		"job_id" : "1411993",
		"category" : "",
		"location" : "Hyderabad, Andhra Pradesh, India",
		"country" : "India",
		"state" : "Andhra Pradesh",
		"city" : "Hyderabad",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "2020-08-03",
		"description" : "Key skills required for the job are: n Cloud Security-L3, (Mandatory) .As a Lead, you are responsible for managing a small team of analysts, developers, testers or engineers and drive delivery of a small module within a project (Delivery/Maintenence/Testing) You may serve as entry level specialist with expertise in particular technology/industry domain/a process / application / product. You are responsible for functional/technical track of a project. Minimum work experience: 5 - 8 YEARS<br><br><b>Roles and Responsibilities</b><br><b>Mandatory Skills:</b> Cloud Security-L3<br> <b>Experience Range:</b> 5-8 YEARS",
		"URL" : "https://careers.wipro.com/careers-home/jobs/1411993?lang=en-us"
	}, {
		"company_name" : "IBM",
		"job_title" : "Application Developer: Java Full Stack",
		"job_id" : "289494BR",
		"category" : "Technical Specialist",
		"location" : "Bangalore, Karnataka, India",
		"country" : "India",
		"state" : "Karnataka",
		"city" : "Bangalore",
		"postal_code" : "",
		"job_type" : "Full-Time",
		"date_posted" : "",
		"description" : "Introduction <br>As an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world's technology leader. Come to IBM and make a global impact!<br><br>Your Role and Responsibilities <br> <strong> Your day in the role will include... </strong> <ul><li> Expert in Backend and Front end technologies </li><li> Proven in developing and implementation and providing solutions to the given problem in all the Java technologies </li><li> Proficient in stitch together end to end application starting from front end web development, back end development, middleware integration and persisting data in no SQL or DBMS database </li><li> Strong into trends and directions of the Industry, marketplace and the players </li><li> Provide objective guidance without personal or political considerations </li></ul> <strong> You will come with... </strong> <ul><li> Hands on experience with JAVA 8 and above - Java 8 or higher. Should know both Spring and Hibernate. Spring 4 or above. </li><li> Should be experienced in OOP concepts well. Should be proficient in exception handling , collections, Abstract Classes and Interfaces, Constructors, File IO and Serialization, Collections (List, Map, Set), Access Specifiers, Exceptions (Checked, Unchecked), Generics, Java Keywords (Static, Final, Volatile, Synchronized, Transient), JVM and Memory Management, Multithreading and Synchronization, JSP/ Servlets,JMS . Should be skilled in one of the IDEs like Eclipse , IntelliJ. Should be conversant with Build tools like Ant , Maven. </li><li> Experience of working in HTML 5 , CSS3, Angular JS, Spring MVC, Spring Boot, REST API, JUnit </li></ul> <strong> How we'll help you grow: </strong> <ul><li> You'll have access to all the technical and management training courses that will help you </li><li> You'll learn directly from guide developers in the field; our team leads love to mentor </li><li> You have the opportunity to work in many different areas to identify what really excites you </li></ul><br><br>Required Technical and Professional Expertise <br><ul><li> Java 8 , JEE, Spring Core, Spring Boot, Spring MVC, REST , Hibernate, Angular JS , Node JS, CSS3 , HTML5, Any RDBMS database (DB2, Postgre, MYSQL, Oracle etc.) and Sql knowledge , Git , Maven, Eclipse / Intellij, Design Patterns </li></ul><br><br>Preferred Technical and Professional Expertise <br> &bull;  Microservices , Docker, Spring Cloud, GW <br><br>About Business Unit <br>IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.<br><br>Your Life @ IBM <br>What matters to you when you're looking for your next career challenge?<br><br>Maybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.<br><br>Impact. Inclusion. Infinite Experiences. Do your best work ever.<br><br>About IBM <br>IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.<br><br>Location Statement <br>For additional information about location requirements, please discuss with the recruiter following submission of your application.<br><br>Being You @ IBM <br>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br><br>Key Job Details <ul> <li> Country: IN</li> <li> State: KARNATAKA</li> <li> City: Bangalore</li> <li> Category: Technical Specialist</li> <li> Required Education: Bachelor's Degree</li> <li> Position Type: Early Professional</li> <li> Employment Type: Full-Time</li> <li> Contract Type: Regular</li> <li> Company: (0063) IBM India Private Limited</li> <li> Req ID: 289494BR</li> <li> Location: Bangalore, KA IN</li> </ul>",
		"URL" : "https://careers.ibm.com/ShowJob/Id/966492/Application-Developer-Java-Full-Stack/?lang=en"
	}, {
		"company_name" : "Weblee Technologies",
		"job_title" : "Hiring PHP Developers,Freshers are Welcome,Location-Kolkata",
		"job_id" : "1369986396",
		"category" : "Engineering",
		"location" : "Kolkata, West Bengal, India",
		"country" : "India",
		"state" : "West Bengal",
		"city" : "Kolkata",
		"postal_code" : "",
		"job_type" : "Full Time",
		"date_posted" : "",
		"description" : "<b>Company Description</b><br><br>Our expertise in designing <br>custom WordPress and CMS websites take us into a league of extraordinary<br> companies who push the boundaries to the limits through forward <br>thinking web design solutions that definitely creates an impact for a <br>business in a positive way. Blending technical prowess with creativity, <br>Website Design Company India develops extraordinary websites and <br>eCommerce solutions for enterprises, globally. We integrate and <br>incorporate the best web design features along with social media <br>integration and search engine optimization elements that make a site <br>overwhelming in the eyes of customers as well as search engines. The <br>soul of your business lies in your website and we are here to give wings<br> to it..<br><br><b>Job Description</b><br><br><strong>Weclome To Weblee Technologies!!!</strong><br><br><strong>We are Hiring for </strong><b>Software and Web-Developer or Designer:</b><br><br><b>See on Naukri also by following us and also get job Alerts</b><br> www.naukri.com/recruiters/webleetechnologies<br><br><b>Job Description</b><br><br>Qualification : <b>BE, Btech, Mtech (CS &IT), BCA, MCA, BSc(Computer Science)</b><br> Experience: Fresher and Experienced both can apply<br> Salary : <b>7K to 15K</b><br> <b>Company is working on various Technologies like: -</b><br><br><b>PHP</b><br><br><b>JAVA , J2EE</b><br><br><b>PHP & MS SQL</b><br><br><b>.NET (C#,VB.NET,ASP.NET)</b><br><br><b>ANROID</b><br><br><b>JAVASCRIPT</b><br><br><b>HTML 5</b><br><br><b>ANGULAR JS</b><br><br><b>JSCRIPT</b><br><br><b>SEO/SMO</b><br><br><b>Facilities: </b>Accommodation + TA + Insurance. (Depends Upon Company to Company)<br><br>Criteria : Excellent ENGLISH communication required.<br><br>- B.E./B.Tech. can also apply. <br><br>Employee Benefits :<br> 1.Performance based incentives.<br> 2.2 weekly Offs - Consecutive Rotational.<br> 3.Loyalty Bonus<br><br><b>Weblee Technologies</b><br><br>Contact Must Call Between 11 A.M- 2 P.M<br><br>Pousali Madam +91-(82309)(21581)<br><br><b>Address: DB 37 Baguiati, Joramandir, Near Allahabad Bank or Harmoni House Kolkata</b>",
		"URL" : "https://jobs.smartrecruiters.com/webleetechnologies/743999658030675"
	}, {
		"company_name" : "Vmware",
		"job_title" : "Senior Member of Technical Staff (C  C++. Python, Automation, DevOps - 7 to 12 years)",
		"job_id" : "R2007259",
		"category" : "Engineering and Technology",
		"location" : "Pune, India",
		"country" : "India",
		"state" : "",
		"city" : "Pune",
		"postal_code" : "",
		"job_type" : "Full-Time",
		"date_posted" : "2020-08-17",
		"description" : "VMware is looking for software engineers who are interested in joining NSBU DevOps Team. The ideal candidate is someone who has a wide variety of experience ranging from Linux system administration, networking skills, object oriented programming, Web app development, virtualization software, building clouds/cloud administration.<br><br>We are looking for a person who is passionate about building efficient infrastructure for building & testing enterprise scale software. This engineer is creative and eager to take on the challenge of building, testing and managing distributed infrastructure. Use computer science and latest software development methodologies rather than merely hacking together yet another script.<br><br>You will participate in many innovative projects, with the authority and scope to apply your expertise in a fast paced and technically driven environment. You'll be part of a bright engineering team that has an open communication, empowerment, innovation, teamwork and customer success culture.<br><br>This is a rewarding position for people who love to problem solve, revel in figuring out complex problems, work with core infrastructure, and have a thirst for learning.<br><br>Requirements:<br><br>&bull; 7 to 12 years' experience<br>&bull;  Strong coding skills in Python with emphasis on writing modular, scalable code.<br>&bull;  Ability to read and debug C/C++ code will be a plus.<br>&bull;  Familiarity with common unit test frameworks in C++, Python, Java<br>&bull;  Familiarity with code coverage tools in C++, Python, Java<br>&bull;  Communication skills for a highly collaborative software development process.<br>&bull;  Excellent verbal communication, analytical skill and critical thinking.<br><br>Desired Skills:<br>&bull;  Experience with Git, Perforce<br><br>&bull;  Experience with build tools like Makefile, Ant, Maven, Bazel<br><br>&bull;  Experience with Linux <br><br>&bull;  Experience with Python, Perl, Shell Scripts<br><br>&bull;  Understanding about Product Securiry and Scanning for finding vulnerabilities <br><br>&bull;  Experience with Django, BuildBot, Python based testing frameworks.<br><br>Responsibilities:<br>&bull;  Develop scalable build and testing infrastructure.<br>&bull;  Develop test metric reporting system to including scan progress, results, and coverage.<br>&bull;  Strong passion for developing new software - fast. Participate in code reviews.<br>&bull;  Participate in the architecture, design, and implementation of next generation Testing infrastructure<br>&bull;  Communicate with all stakeholders and team members and provide updates perform other duties and responsibilities as requested or required<br><br>Education:<br>A Computer Science or related undergraduate and/or master's degree is required. Any other demonstrated high technology aptitude is desired.<br><br><b>Category : </b>Engineering and Technology<br><b>Subcategory: </b>Software Engineering<br><b>Experience: </b>Manager and Professional<br><b>Full Time/ Part Time: </b>Full Time<br><b>Posted Date:</b> 2020-08-17<br><br>VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what's possible today at http://careers.vmware.com.<br><br>Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
		"URL" : "https://careers.vmware.com/main/jobs/R2007259"
	}, {
		"company_name" : "Tata Consultancy Services Limited",
		"job_title" : "Java Fullstack Developer",
		"job_id" : "161219",
		"category" : "Technology",
		"location" : "Kolkata, India",
		"country" : "India",
		"state" : "",
		"city" : "Kolkata",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "",
		"description" : "<strong>Job Description</strong><br><br>TCS has always been in thespotlight for being adept in \"the next big technologies\". What we can offer youis a space to explore varied technologies and quench your techie soul.<br><br>As a Developer, you will capture data to translate and transform it intoa processing language and build industry specific solutions based on industryneeds, manage and upgrade existing applications.<br><br><strong>What we are looking for</strong><br><br><strong> Must Have:</strong> Java, ReactJS, NodeJS<br><br><strong> Good to Have:</strong> HTML CSS<br><br><strong>Minimum Qualification:</strong><br><br>&bull; 15 years of full-time education<br><br>&bull; Minimum percentile of 50% in 10th, 12th, UG& PG (if applicable)",
		"URL" : "https://ibegin.tcs.com/iBegin/jobs/161219J"
	}, {
		"company_name" : "Infostretch Corporation",
		"job_title" : "Software Engineer (Cloud)",
		"job_id" : "x3TALNhUHa2u",
		"category" : "Engineering",
		"location" : "Pune, Maharashtra, India",
		"country" : "India",
		"state" : "Maharashtra",
		"city" : "Pune",
		"postal_code" : "",
		"job_type" : "Full Time",
		"date_posted" : "2020-06-30",
		"description" : "<strong>Description</strong><br><br>Role Description & Responsibilities<br><br>We are seeking a Cloud/Backend developer to drive technical excellence to scale the AI and cloud computing roadmap. As a critical member of the technical team, you will work closely with the tech leads and cross-functional leads to integrate and implement an end-to-end cloud services infrastructure.<br><br>The ideal candidate will have a mix of enterprise and start-up experience with a proven track record of technical expertise in cloud computing, APIs, data analytics, and services. Success in this role requires an analytical, data-driven approach with a focus on patient safety, scalability, reliability, and security. <br><br>Core Responsibilities<br><ul><li>Develop scalable software systems for storage, analysis, and retrieval of data.</li><li>Ensure performance and robustness of back end services on the cloud with customer and partner integrations</li><li>Develop secure, clean and maintainable code and best practices.</li></ul><br>Minimum Experience, Skills, and Qualifications<br><ul><li>Minimum 3+ years' experience.</li><li>Graduate Degree in Computer Science or Engineering</li><li>Demonstrated proficiency with Python</li><li>Expertise with cloud-based technologies (AWS, Azure, GCP)</li><li>Expertise with databases and storage technologies</li><li>Excellent critical thinking skills and creative problem-solving abilities</li><li>Enthusiasm for continuous learning and professional development</li><li>Ability to work well both independently and as part of a team</li></ul><br>Desired Experience, Skills, and Qualifications<br><ul><li>Proficiency in Java, Javascript, or SQL</li><li>Experience with common Python libraries<ul><li>Web frameworks (Django, Flask)</li><li>Data science (Pandas, Numpy, Scipy)</li></ul></li><li>Experience using Google Cloud Platform</li><li>Experience with Docker containers and Kubernetes</li><li>Expertise in unit testing, integration testing, continuous integration and deployment, and test-driven development</li><li>Experience working in the biomedical sciences is a plus</li></ul>",
		"URL" : "https://jobs.jobvite.com/info-stretch-corporation/job/o6eZcfwf?nl=1&nl=1"
	}, {
		"company_name" : "Hewlett Packard Enterprise Company",
		"job_title" : "Java FullStack Developer",
		"job_id" : "1067059",
		"category" : "Information Technology",
		"location" : "Bangalore, Karnataka, India",
		"country" : "India",
		"state" : "Karnataka",
		"city" : "Bangalore",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "",
		"description" : "Hewlett Packard Enterprise is not only the company best equipped to build a bridge from where enterprise IT is today, to where it needs to be, but HPE is also an incredible place to build a career. As the only company that brings it all-software, hardware, services, and talented people with the right mindset-we help organizations innovate, stay competitive, and quickly turn ideas into value. <br><br>Hewlett Packard Enterprise is an innovative, dynamic company with a rich past and a promising future. Originally Hewlett-Packard Company, HPE has continuously reinvented itself. Today, HPE is one of the world's leading technology companies and provides wired and wireless networking, servers, storage, IT and Cloud services for the next generation of IT infrastructure. <br><br><b> <b>Job Description:</b> </b><br><br>As a member of our application development and support Team you will dive head-first into creating innovative solutions that advance businesses and careers. You'll join an inspiring and curious team of technologists dedicated to improving the design, analytics, development, coding, testing and application programming that goes into creating high quality software and new products. Coming in with an understanding of the importance of end-to-end software development-support. Understand real world business processes, Experience full Software Development Lifecycle (SDLC) and be part of it, Explore new skills, implement innovative solutions and make your mark. This role requires a wide variety of strengths and capabilities, including BSBE/BSCS degree in Science and Technology or equivalent experience. <br><br><b> <b>Responsibilities:</b> </b><br><ul><li>Lead and provide technical direction in the analysis, design, development, testing, deployment, maintenance, and enhancement of technical solutions related to enterprise applications projects.</li><li>Integration of user-facing elements developed by front-end developers on Angular JS with integration of Spring boot server side logic</li><li>Writing/Supporting scalable, reusable, testable, and efficient code</li><li> Design/ implementation and maintenance of low-latency, high-availability, and performant applications</li><li>.Debug and performance tune applications. Code review, approve MTIs and MTPs</li><li>Drive/Lead Major escalations with dependent teams to drive the issues to closure</li><li>L1-L4 support</li><li>Ability to work in shifts or weekends</li><li>Most important is the ownership of the problem and overcome challenges to maintain business continuity with no barriers.</li></ul><br><br><b> <b>Solid technical skills in following: </b> </b><br><br><ul><li>10+ years of experience as full stack Java Developer</li><li>Angular 8 is a must and UI design patterns along with Boot Strap as nice to have skills - 3-4 years of hands on experience</li><li>Java SpringBoot</li><li>RestFul/Web Services, XML, REST, SOAP, JSON</li><li>Strong Database design skills including SQL, procedures</li><li>Service Design Concepts, OO and Functional Development concepts.</li><li> Devops, automation of testing, deployment for CI/CD, Agile(SCRUM, Kanban) </li><li> Experience with infrastructure, security, scaling, support, troubleshooting, monitoring, alerts, messaging patterns, integration patterns, API, cloud,SOA, microservices principles </li><li>Proficiency on Linux, Jboss, Apache Tomcat, GitHub is a must</li><li>Strong oral and written communication skills</li><li>Excellent interpersonal skills and professional approach</li></ul><br><br>Desired skills<br><br>Informatica MDM<br><br><b>Hewlett Packard Enterprise Values</b> : <br><br> Partnership first: We believe in the power of collaboration - building long term relationships with our customers, our partners and each other <br><br> Bias for action: We never sit still - we take advantage of every opportunity <br><br> Innovators at heart: We are driven to innovate - creating both practical and breakthrough advancements <br><br>What do we offer? <br><br>Extensive social benefits, flexible working hours, a competitive salary and shared values, make Hewlett Packard Enterprise one of the world's most attractive employers. At HPE our goal is to provide equal opportunities, work-life balance, and constantly evolving career opportunities. <br><br> If you are looking for challenges in a pleasant and international work environment, then we definitely want to hear from you. Apply now below, or directly via our Careers Portal at www.hpe.com/careers <br><br> You can also find us on: <br><br> https://www.facebook.com/HPECareers <br><br> https://twitter.com/HPE_Careers <br><br>#GlobalITIN<br><br>1067059",
		"URL" : "https://careers.hpe.com/job/Hewlett-Packard-Enterprise-Bangalore-Karnataka/111790628"
	}, {
		"company_name" : "Amazon",
		"job_title" : "Software Development Manager",
		"job_id" : "1205605",
		"category" : "Software Development",
		"location" : "Hyderabad, India",
		"country" : "India",
		"state" : "",
		"city" : "Hyderabad",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "July 15, 2020",
		"description" : "Innovating on behalf of Last Mile Delivery Service Providers<br><br>It's no secret that Amazon relies on its technology to deliver millions of packages every day to its customers - on time, with low cost. Our Last Mile technology division builds the complex software solutions that work across our vendors, delivery stations and carriers to optimize both time & cost of getting the packages delivered. This remains a fast growing business, and our technical journey has only started. With rapid expansion into new geographies, innovations in logistics, unique delivery models for products ranging from Fresh groceries to big-screen TV's, and growing number of shipments worldwide, we see a brand new opportunity to fundamentally change the way people get the stuff they need, and make a big impact by cutting billions of dollars of transportation costs from the ecosystem. Our mission is to build the most efficient and optimal last mile transportation system on the planet.<br><br>You'll design and develop systems and applications used by Amazon worldwide and will regularly interact with engineering and business leadership. You will participate in the planning and execution of technology projects and operational excellence initiatives. You'll also manage and build a team of world class engineers in employing strong design and implementation practices. You will be participating in creating vision and influence product road-map across multiple stakeholders.<br>You will be expected to have an established background in building highly scalable systems and applications, great communication skills, strong people management skills and a motivation to achieve results in a fast paced environment. You should be somebody who enjoys working on complex system software, is customer-centric, and feels strongly about building good software as well as making that software achieve its operational goals. Experience with building and operating web-based applications and/or web services-based applications, especially at massive scale, will be very applicable and helpful.<br>Come and see for yourself why we are one of the most admired company in the US, rated #1 in Innovation and # 1 in Customer Service, and be part of our tradition of working hard, having fun and making history!<br>The successful candidate will:<br>- Be responsible for the end to end ownership of a technology team, including setting the technical vision for developing our systems to serve Amazon's needs.<br>- Build and manage great software engineers and tech leaders that are responsible for developing and maintaining software that optimizes our transportation network.<br>- Be a champion of engineering and operational excellence: establish team metrics for measurement of engineering and operational excellence and a consistent, regular process for assessment and improvement.<br>- Establish a consistent, project management framework and excellent development processes to deliver high quality software, in rapid iterations, for business partners in multiple geographies.<br>- Show strong business and technical judgment that will accelerate time to market of releases, while incrementally moving our services towards the long term vision.<br>- Be responsible for mentoring and developing engineers, managers and other related job roles.<br>- Represent the technical organization and evangelize the work to senior leadership.<br>- Raise the bar on technical excellence, show thought leadership, and communicate well to different audiences.<br><br><b>BASIC QUALIFICATIONS</b><br><br>&bull;  7+ years of relevant engineering experience<br>&bull;  3+ years of people management experience, managing engineers<br>&bull;  Experience in partnering with product and program management teams<br>&bull;  Bachelor's degree and/or Master's degree in Computer Science or equivalent.<br>&bull;  A minimum of 5 years of management experience.<br>&bull;  A minimum of 5 years of relevant development and design experience.<br>&bull;  Experience in building high-performance, highly-available and scalable distributed systems.<br>&bull;  Experience with employee development, performance management and delivering results.<br>&bull;  Problem-solving skills and the abilities to analyze quantitatively, scope technical requirements and effectively prioritize program deliverables.<br>&bull;  Presentation and written communication skills are essential, as is the ability to build partnerships with senior leaders across a variety of groups throughout Amazon.<br><br><b>PREFERRED QUALIFICATIONS</b><br><br>&bull;  Proven experience establishing metrics for measurement of engineering and operational excellence.<br>&bull;  Proven experience in innovative business practices that have been game changing for business evolution.",
		"URL" : "https://www.amazon.jobs/en/jobs/1205605/software-development-manager"
	}, {
		"company_name" : "Larsen & Toubro Infotech Ltd",
		"job_title" : "Full Stack Python Lead",
		"job_id" : "600237201",
		"category" : "Database, Linux, SQL",
		"location" : "India",
		"country" : "India",
		"state" : "",
		"city" : "",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "",
		"description" : "<strong>Personality:</strong> A problem solver who is passionate about programming and quick to adapt to new techniques & technologies to get the job done. <br><br><strong> Must Have: </strong><br> <br> o Proven-deep-expertise with Python programming (2 to 4 Years minimum hands-on experience in Python) <br> <br> o Experience with building APIs and services using REST, SOAP, etc. <br> <br> o Solid understanding of OOPS and Demonstrated experience in SQL <br> <br> o Experience working in Linux/UNIX/UNIX-like environment with an ability to execute basic OS commands. <br><br><strong> Good to Have: </strong><br> <br> o Natural language processing with NLTK, Spacy or Gensim libraries. <br> <br> o Knowledge of OpenNLP, StanfordNLP, Translation, Semantic Ontology, Natural Language understanding/generation <br> <br> o Knowledge of frameworks like Django, Flask, Gunicorn etc. <br> <br> o Knowledge of / Hands-on experience in working with Cloud IaaS such as AWS, Azure and GC <br> <br> o Knowledge of / Experience with Scrum/Agile development methodologies <br><br><strong>Job Segment: </strong> Database, Linux, SQL, Unix, Technology",
		"URL" : "https://careers.lntinfotech.com/job/Pune-Python-Developer-MH/600237201/"
	}, {
		"company_name" : "Stafficeglobal",
		"job_title" : "Senior Java Developer",
		"job_id" : "lhvKPaDOjFq2",
		"category" : "",
		"location" : "Chennai, Tamil Nadu, India",
		"country" : "India",
		"state" : "Tamil Nadu",
		"city" : "Chennai",
		"postal_code" : "",
		"job_type" : "",
		"date_posted" : "Dec 23, 2019",
		"description" : "<b>Job Description</b><br> <br> <ul> <li>Ca<strong>ndidate</strong>s must have substantial applicable IT experience, extensive development, programming experience in <strong>Core Java, J2ee, Spring, Hibernate, Webservices using Restful, any DB (Oracle, SQL server).</strong></li> <li>Preferably the candidate must have worked in development projects and must have experience in design patterns.</li> <li>Candidate must have excellent communication and must be willing to play an individual contributor role.</li> <li>Candidates must hold a Bachelor's degree in a relevant subject and have strong communication and client interfacing skills.</li> </ul> <br> <br><b>Required Skills</b><br> Core Java, J2ee, Spring, Hibernate, Webservices using Restful, any DB (Oracle, SQL server). <br><br><b>Dec 23, 2019</b><br><br><b>4 - 6 Years Exp.</b><br><br><b>2 Vacancies</b>",
		"URL" : "http://recruitx.talentnow.com/careerX/Home/ViewJobDetail?Id=g6WQ/KwnuCoFdFEJudsGJRdm2YVraOof86hEoPanNAusjEg2wBW2w+Ft5c86HNo42LVCnEqsTXwRc1C+i3w+Jg=="
    }
]}